# GeekBrains > Python basics: Oleg Gladkiy (https://geekbrains.ru/users/3837199)
homework_type = "Lesson-6. 2-Road"
# 2. Реализовать класс Road (дорога), в котором определить атрибуты:
#    length (длина), width (ширина). Значения данных атрибутов должны передаваться
#    при создании экземпляра класса. Атрибуты сделать защищенными.
#    Определить метод расчета массы асфальта, необходимого для покрытия всего
#    дорожного полотна. Использовать формулу: длина * ширина * масса асфальта
#    для покрытия одного кв метра дороги асфальтом, толщиной в 1 см * чи сло см толщины полотна.
#    Проверить работу метода.
#    Например: 20м * 5000м * 25кг * 5см = 12500 т
print(homework_type)



print("End")
