# GeekBrains > Python basics: Oleg Gladkiy (https://geekbrains.ru/users/3837199)
homework_type = "Lesson-6. 5_Stationery"
# 5. Реализовать класс Stationery (канцелярская принадлежность).
#    Определить в нем атрибут title (название) и метод draw (отрисовка). Метод выводит
#    сообщение “Запуск отрисовки.” Создать три дочерних класса Pen (ручка), Pencil (карандаш),
#    Handle (маркер). В каждом из классов реализовать переопределение метода draw.
#    Для каждого из классов методы должен выводить уникальное сообщение.
#    Создать экземпляры классов и проверить, что выведет описанный метод для каждого экземпляра.
print(homework_type)



print("End")
